//COUNT    EXEC PGM=COUNT
//STEPLIB  DD DSN=MYUSER.LOADLIB,DISP=SHR
//INPUT    DD DSN=MYUSER.SOURCE(PAYROLL),DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSTERM  DD SYSOUT=*
