//MEMBER   EXEC PGM=MEMBER,PARM='JAN'
//STEPLIB  DD DSN=MYUSER.LOADLIB,DISP=SHR
//OUTLIB   DD DSN=MYUSER.REPORTS,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSTERM  DD SYSOUT=*
