//NEWDS    EXEC PGM=NEWDS,PARM='MYUSER.CONTROL.CARDS'
//STEPLIB  DD DSN=MYUSER.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSTERM  DD SYSOUT=*
//SYSIN    DD *
  RUN  DAILY
  KEEP 30
/*
