//VBCOPY   EXEC PGM=VBCOPY
//STEPLIB  DD DSN=MYUSER.LOADLIB,DISP=SHR
//INPUT    DD DSN=MYUSER.LOG.DATA,DISP=SHR
//OUTPUT   DD DSN=MYUSER.LOG.COPY,DISP=(NEW,CATLG),
//            UNIT=SYSDA,SPACE=(TRK,(10,10),RLSE),
//            DCB=(RECFM=VB,LRECL=1028,BLKSIZE=6144)
//SYSPRINT DD SYSOUT=*
//SYSTERM  DD SYSOUT=*
