//ERRTEXT  EXEC PGM=ERRTEXT
//STEPLIB  DD DSN=MYUSER.LOADLIB,DISP=SHR
//OUTPUT   DD DSN=&&SMALL,DISP=(NEW,DELETE),UNIT=SYSDA,
//            SPACE=(TRK,(1,0)),DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//SYSPRINT DD SYSOUT=*
//SYSTERM  DD SYSOUT=*
