//RUN      EXEC PGM=ENVDEMO
//STEPLIB  DD DISP=SHR,DSN=MY.LOADLIB
//SYSPRINT DD SYSOUT=*
//SYSTERM  DD SYSOUT=*
//SYSENV   DD *
* environment for ENVDEMO
INPUT=MY.DATA(MEMBER1)
TZ=1
/*
