//WAIT     EXEC PGM=SUBMIT
//STEPLIB  DD DISP=SHR,DSN=HLQ.LOADLIB
//HASPCKPT DD DISP=SHR,DSN=SYS1.HASPCKPT
//HASPACE1 DD DISP=SHR,DSN=SYS1.HASPACE
//SYSPRINT DD SYSOUT=*
