//REPORT   EXEC PGM=RCODE,PARM='250'
//STEPLIB  DD DSN=MYUSER.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSTERM  DD SYSOUT=*
//*        runs only if REPORT ended with 4 or less
//NEXT     EXEC PGM=IEFBR14,COND=(4,LT,REPORT)
